; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p5---int100n150-m25---int100c150---s96---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level5 level5)
(sum level0 level10 level10)
(sum level0 level11 level11)
(sum level0 level12 level12)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level1 level1 level2)
(sum level1 level5 level6)
(sum level1 level10 level11)
(sum level1 level11 level12)
(sum level1 level12 level13)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level2 level1 level3)
(sum level2 level5 level7)
(sum level2 level10 level12)
(sum level2 level11 level13)
(sum level2 level12 level14)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level3 level1 level4)
(sum level3 level5 level8)
(sum level3 level10 level13)
(sum level3 level11 level14)
(sum level3 level12 level15)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level4 level1 level5)
(sum level4 level5 level9)
(sum level4 level10 level14)
(sum level4 level11 level15)
(sum level4 level12 level16)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level5 level1 level6)
(sum level5 level5 level10)
(sum level5 level10 level15)
(sum level5 level11 level16)
(sum level5 level12 level17)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level6 level1 level7)
(sum level6 level5 level11)
(sum level6 level10 level16)
(sum level6 level11 level17)
(sum level6 level12 level18)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level7 level1 level8)
(sum level7 level5 level12)
(sum level7 level10 level17)
(sum level7 level11 level18)
(sum level7 level12 level19)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level8 level1 level9)
(sum level8 level5 level13)
(sum level8 level10 level18)
(sum level8 level11 level19)
(sum level8 level12 level20)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level9 level1 level10)
(sum level9 level5 level14)
(sum level9 level10 level19)
(sum level9 level11 level20)
(sum level9 level12 level21)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level10 level1 level11)
(sum level10 level5 level15)
(sum level10 level10 level20)
(sum level10 level11 level21)
(sum level10 level12 level22)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level11 level1 level12)
(sum level11 level5 level16)
(sum level11 level10 level21)
(sum level11 level11 level22)
(sum level11 level12 level23)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level12 level1 level13)
(sum level12 level5 level17)
(sum level12 level10 level22)
(sum level12 level11 level23)
(sum level12 level12 level24)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level13 level1 level14)
(sum level13 level5 level18)
(sum level13 level10 level23)
(sum level13 level11 level24)
(sum level13 level12 level25)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level14 level1 level15)
(sum level14 level5 level19)
(sum level14 level10 level24)
(sum level14 level11 level25)
(sum level14 level12 level26)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level15 level1 level16)
(sum level15 level5 level20)
(sum level15 level10 level25)
(sum level15 level11 level26)
(sum level15 level12 level27)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level16 level1 level17)
(sum level16 level5 level21)
(sum level16 level10 level26)
(sum level16 level11 level27)
(sum level16 level12 level28)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level17 level1 level18)
(sum level17 level5 level22)
(sum level17 level10 level27)
(sum level17 level11 level28)
(sum level17 level12 level29)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level18 level1 level19)
(sum level18 level5 level23)
(sum level18 level10 level28)
(sum level18 level11 level29)
(sum level18 level12 level30)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level19 level1 level20)
(sum level19 level5 level24)
(sum level19 level10 level29)
(sum level19 level11 level30)
(sum level19 level12 level31)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level20 level1 level21)
(sum level20 level5 level25)
(sum level20 level10 level30)
(sum level20 level11 level31)
(sum level20 level12 level32)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level21 level1 level22)
(sum level21 level5 level26)
(sum level21 level10 level31)
(sum level21 level11 level32)
(sum level21 level12 level33)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level22 level1 level23)
(sum level22 level5 level27)
(sum level22 level10 level32)
(sum level22 level11 level33)
(sum level22 level12 level34)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level23 level1 level24)
(sum level23 level5 level28)
(sum level23 level10 level33)
(sum level23 level11 level34)
(sum level23 level12 level35)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level24 level1 level25)
(sum level24 level5 level29)
(sum level24 level10 level34)
(sum level24 level11 level35)
(sum level24 level12 level36)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level25 level1 level26)
(sum level25 level5 level30)
(sum level25 level10 level35)
(sum level25 level11 level36)
(sum level25 level12 level37)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level26 level1 level27)
(sum level26 level5 level31)
(sum level26 level10 level36)
(sum level26 level11 level37)
(sum level26 level12 level38)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level27 level1 level28)
(sum level27 level5 level32)
(sum level27 level10 level37)
(sum level27 level11 level38)
(sum level27 level12 level39)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level28 level1 level29)
(sum level28 level5 level33)
(sum level28 level10 level38)
(sum level28 level11 level39)
(sum level28 level12 level40)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level29 level1 level30)
(sum level29 level5 level34)
(sum level29 level10 level39)
(sum level29 level11 level40)
(sum level29 level12 level41)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level30 level1 level31)
(sum level30 level5 level35)
(sum level30 level10 level40)
(sum level30 level11 level41)
(sum level30 level12 level42)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level23 level53)
(sum level31 level1 level32)
(sum level31 level5 level36)
(sum level31 level10 level41)
(sum level31 level11 level42)
(sum level31 level12 level43)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level23 level54)
(sum level32 level1 level33)
(sum level32 level5 level37)
(sum level32 level10 level42)
(sum level32 level11 level43)
(sum level32 level12 level44)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level23 level55)
(sum level33 level1 level34)
(sum level33 level5 level38)
(sum level33 level10 level43)
(sum level33 level11 level44)
(sum level33 level12 level45)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level23 level56)
(sum level34 level1 level35)
(sum level34 level5 level39)
(sum level34 level10 level44)
(sum level34 level11 level45)
(sum level34 level12 level46)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level23 level57)
(sum level35 level1 level36)
(sum level35 level5 level40)
(sum level35 level10 level45)
(sum level35 level11 level46)
(sum level35 level12 level47)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level23 level58)
(sum level36 level1 level37)
(sum level36 level5 level41)
(sum level36 level10 level46)
(sum level36 level11 level47)
(sum level36 level12 level48)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level23 level59)
(sum level37 level1 level38)
(sum level37 level5 level42)
(sum level37 level10 level47)
(sum level37 level11 level48)
(sum level37 level12 level49)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level23 level60)
(sum level38 level1 level39)
(sum level38 level5 level43)
(sum level38 level10 level48)
(sum level38 level11 level49)
(sum level38 level12 level50)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level23 level61)
(sum level39 level1 level40)
(sum level39 level5 level44)
(sum level39 level10 level49)
(sum level39 level11 level50)
(sum level39 level12 level51)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level23 level62)
(sum level40 level1 level41)
(sum level40 level5 level45)
(sum level40 level10 level50)
(sum level40 level11 level51)
(sum level40 level12 level52)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level23 level63)
(sum level41 level1 level42)
(sum level41 level5 level46)
(sum level41 level10 level51)
(sum level41 level11 level52)
(sum level41 level12 level53)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level23 level64)
(sum level42 level1 level43)
(sum level42 level5 level47)
(sum level42 level10 level52)
(sum level42 level11 level53)
(sum level42 level12 level54)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level42 level23 level65)
(sum level43 level1 level44)
(sum level43 level5 level48)
(sum level43 level10 level53)
(sum level43 level11 level54)
(sum level43 level12 level55)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level43 level23 level66)
(sum level44 level1 level45)
(sum level44 level5 level49)
(sum level44 level10 level54)
(sum level44 level11 level55)
(sum level44 level12 level56)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level44 level23 level67)
(sum level45 level1 level46)
(sum level45 level5 level50)
(sum level45 level10 level55)
(sum level45 level11 level56)
(sum level45 level12 level57)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level45 level23 level68)
(sum level46 level1 level47)
(sum level46 level5 level51)
(sum level46 level10 level56)
(sum level46 level11 level57)
(sum level46 level12 level58)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level46 level23 level69)
(sum level47 level1 level48)
(sum level47 level5 level52)
(sum level47 level10 level57)
(sum level47 level11 level58)
(sum level47 level12 level59)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level47 level23 level70)
(sum level48 level1 level49)
(sum level48 level5 level53)
(sum level48 level10 level58)
(sum level48 level11 level59)
(sum level48 level12 level60)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level48 level23 level71)
(sum level49 level1 level50)
(sum level49 level5 level54)
(sum level49 level10 level59)
(sum level49 level11 level60)
(sum level49 level12 level61)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level49 level23 level72)
(sum level50 level1 level51)
(sum level50 level5 level55)
(sum level50 level10 level60)
(sum level50 level11 level61)
(sum level50 level12 level62)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level50 level23 level73)
(sum level51 level1 level52)
(sum level51 level5 level56)
(sum level51 level10 level61)
(sum level51 level11 level62)
(sum level51 level12 level63)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level51 level23 level74)
(sum level52 level1 level53)
(sum level52 level5 level57)
(sum level52 level10 level62)
(sum level52 level11 level63)
(sum level52 level12 level64)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level52 level23 level75)
(sum level53 level1 level54)
(sum level53 level5 level58)
(sum level53 level10 level63)
(sum level53 level11 level64)
(sum level53 level12 level65)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level53 level23 level76)
(sum level54 level1 level55)
(sum level54 level5 level59)
(sum level54 level10 level64)
(sum level54 level11 level65)
(sum level54 level12 level66)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level54 level23 level77)
(sum level55 level1 level56)
(sum level55 level5 level60)
(sum level55 level10 level65)
(sum level55 level11 level66)
(sum level55 level12 level67)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level55 level23 level78)
(sum level56 level1 level57)
(sum level56 level5 level61)
(sum level56 level10 level66)
(sum level56 level11 level67)
(sum level56 level12 level68)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level56 level23 level79)
(sum level57 level1 level58)
(sum level57 level5 level62)
(sum level57 level10 level67)
(sum level57 level11 level68)
(sum level57 level12 level69)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level57 level23 level80)
(sum level58 level1 level59)
(sum level58 level5 level63)
(sum level58 level10 level68)
(sum level58 level11 level69)
(sum level58 level12 level70)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level58 level23 level81)
(sum level59 level1 level60)
(sum level59 level5 level64)
(sum level59 level10 level69)
(sum level59 level11 level70)
(sum level59 level12 level71)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level59 level23 level82)
(sum level60 level1 level61)
(sum level60 level5 level65)
(sum level60 level10 level70)
(sum level60 level11 level71)
(sum level60 level12 level72)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level61 level1 level62)
(sum level61 level5 level66)
(sum level61 level10 level71)
(sum level61 level11 level72)
(sum level61 level12 level73)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level62 level1 level63)
(sum level62 level5 level67)
(sum level62 level10 level72)
(sum level62 level11 level73)
(sum level62 level12 level74)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level63 level1 level64)
(sum level63 level5 level68)
(sum level63 level10 level73)
(sum level63 level11 level74)
(sum level63 level12 level75)
(sum level63 level19 level82)
(sum level64 level1 level65)
(sum level64 level5 level69)
(sum level64 level10 level74)
(sum level64 level11 level75)
(sum level64 level12 level76)
(sum level65 level1 level66)
(sum level65 level5 level70)
(sum level65 level10 level75)
(sum level65 level11 level76)
(sum level65 level12 level77)
(sum level66 level1 level67)
(sum level66 level5 level71)
(sum level66 level10 level76)
(sum level66 level11 level77)
(sum level66 level12 level78)
(sum level67 level1 level68)
(sum level67 level5 level72)
(sum level67 level10 level77)
(sum level67 level11 level78)
(sum level67 level12 level79)
(sum level68 level1 level69)
(sum level68 level5 level73)
(sum level68 level10 level78)
(sum level68 level11 level79)
(sum level68 level12 level80)
(sum level69 level1 level70)
(sum level69 level5 level74)
(sum level69 level10 level79)
(sum level69 level11 level80)
(sum level69 level12 level81)
(sum level70 level1 level71)
(sum level70 level5 level75)
(sum level70 level10 level80)
(sum level70 level11 level81)
(sum level70 level12 level82)
(sum level71 level1 level72)
(sum level71 level5 level76)
(sum level71 level10 level81)
(sum level71 level11 level82)
(sum level72 level1 level73)
(sum level72 level5 level77)
(sum level72 level10 level82)
(sum level73 level1 level74)
(sum level73 level5 level78)
(sum level74 level1 level75)
(sum level74 level5 level79)
(sum level75 level1 level76)
(sum level75 level5 level80)
(sum level76 level1 level77)
(sum level76 level5 level81)
(sum level77 level1 level78)
(sum level77 level5 level82)
(sum level78 level1 level79)
(sum level79 level1 level80)
(sum level80 level1 level81)
(sum level81 level1 level82)

(connected l0 l1)
(fuelcost level5 l0 l1)
(connected l0 l3)
(fuelcost level12 l0 l3)
(connected l0 l4)
(fuelcost level10 l0 l4)
(connected l0 l5)
(fuelcost level11 l0 l5)
(connected l1 l0)
(fuelcost level5 l1 l0)
(connected l1 l3)
(fuelcost level23 l1 l3)
(connected l1 l4)
(fuelcost level20 l1 l4)
(connected l1 l6)
(fuelcost level20 l1 l6)
(connected l2 l4)
(fuelcost level1 l2 l4)
(connected l2 l6)
(fuelcost level19 l2 l6)
(connected l3 l0)
(fuelcost level12 l3 l0)
(connected l3 l1)
(fuelcost level23 l3 l1)
(connected l4 l0)
(fuelcost level10 l4 l0)
(connected l4 l1)
(fuelcost level20 l4 l1)
(connected l4 l2)
(fuelcost level1 l4 l2)
(connected l4 l6)
(fuelcost level20 l4 l6)
(connected l5 l0)
(fuelcost level11 l5 l0)
(connected l6 l1)
(fuelcost level20 l6 l1)
(connected l6 l2)
(fuelcost level19 l6 l2)
(connected l6 l4)
(fuelcost level20 l6 l4)

(at t0 l2)
(fuel t0 level82)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l4)
(at p3 l1)
(at p4 l0)
)

(:goal
(and
(at p0 l3)
(at p1 l2)
(at p2 l3)
(at p3 l0)
(at p4 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 5
2. (drive t0 l2 l4 level81 level1 level82)
   deleted: (at t0 l2) (fuel t0 level82)
   added: (at t0 l4) (fuel t0 level81)
   goals met: 0 of 5
3. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 0 of 5
4. (drive t0 l4 l1 level61 level20 level81)
   deleted: (at t0 l4) (fuel t0 level81)
   added: (at t0 l1) (fuel t0 level61)
   goals met: 0 of 5
5. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 5
6. (drive t0 l1 l3 level38 level23 level61)
   deleted: (at t0 l1) (fuel t0 level61)
   added: (at t0 l3) (fuel t0 level38)
   goals met: 0 of 5
7. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 1 of 5
8. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 2 of 5
9. (drive t0 l3 l0 level26 level12 level38)
   deleted: (at t0 l3) (fuel t0 level38)
   added: (at t0 l0) (fuel t0 level26)
   goals met: 2 of 5
10. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 2 of 5
11. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 2 of 5
12. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 3 of 5
13. (drive t0 l0 l4 level16 level10 level26)
   deleted: (at t0 l0) (fuel t0 level26)
   added: (at t0 l4) (fuel t0 level16)
   goals met: 3 of 5
14. (drive t0 l4 l2 level15 level1 level16)
   deleted: (at t0 l4) (fuel t0 level16)
   added: (at t0 l2) (fuel t0 level15)
   goals met: 3 of 5
15. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 4 of 5
16. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 5 of 5
